Repository: ChrisRapacz/easytools-subscription-manager
Catalog: easytools-subscription-manager/languages/easytools-sub-*.po
Languages: pl_pl

source: Settings
pl_pl: Ustawienia

source: Documentation
pl_pl: Dokumentacja

source: Support
pl_pl: Wsparcie

source: Easytools Subscription
pl_pl: Subskrypcje Easytools

source: Webhook Logs
pl_pl: Logi Webhooków

source: Subscribers
pl_pl: Subskrybenci

source: Webhook Testing
pl_pl: Test Webhooków

source: 🧪 Webhook Testing
pl_pl: 🧪 Test Webhooków

source: Basic Settings
pl_pl: Podstawowe Ustawienia

source: Access Control
pl_pl: Kontrola Dostępu

source: User Registration
pl_pl: Rejestracja Użytkowników

source: Notifications
pl_pl: Powiadomienia

source: Easytools Checkout URL
pl_pl: URL do płatności Easytools

source: Webhook Signing Key
pl_pl: Klucz podpisu Webhook

source: Protect Entire Site
pl_pl: Chroń całą stronę

source: Exclude Pages (if protecting entire site)
pl_pl: Wyklucz strony (jeśli chronisz całą stronę)

source: Protected Pages (if NOT protecting entire site)
pl_pl: Chronione strony (jeśli NIE chronisz całej strony)

source: Prefer Easytools Automation
pl_pl: Preferuj Automatyzację Easytools

source: Automation Wait Time (seconds)
pl_pl: Czas oczekiwania na automatyzację (sekundy)

source: Default User Role
pl_pl: Domyślna rola użytkownika

source: Send Welcome Email
pl_pl: Wyślij email powitalny

source: Admin Notifications
pl_pl: Powiadomienia dla admina

source: Admin Email
pl_pl: Email admina

source: Save Settings
pl_pl: Zapisz ustawienia

source: Configure basic integration settings with Easytools payment platform.
pl_pl: Skonfiguruj podstawowe ustawienia integracji z platformą płatności Easytools.

source: Define which pages require an active subscription to access.
pl_pl: Określ, które strony wymagają aktywnej subskrypcji.

source: Configure how user accounts are created when subscriptions are purchased.
pl_pl: Skonfiguruj sposób tworzenia kont użytkowników przy zakupie subskrypcji.

source: Manage email notifications for subscription events.
pl_pl: Zarządzaj powiadomieniami email o zdarzeniach subskrypcji.

source: URL to Easytools checkout where users without subscription will be redirected. User email will be automatically added to URL.
pl_pl: URL do koszyka Easytools, do którego będą przekierowywani użytkownicy bez subskrypcji. Email użytkownika zostanie automatycznie dodany do URL.

source: Generate in Easytools → API & Webhooks. Used to verify webhook authenticity.
pl_pl: Wygeneruj w Easytools → API & Webhooki. Służy do weryfikacji autentyczności webhooków.

source: Webhook URL:
pl_pl: URL Webhooka:

source: Protect all pages except selected below
pl_pl: Chroń wszystkie strony oprócz wybranych poniżej

source: If checked, entire site will be protected except pages selected in "Exclude Pages".
pl_pl: Jeśli zaznaczone, cała strona będzie chroniona z wyjątkiem stron wybranych w "Wyklucz strony".

source: Pages that will be accessible without subscription (e.g. homepage, login, register).
pl_pl: Strony, które będą dostępne bez subskrypcji (np. strona główna, logowanie, rejestracja).

source: Pages that require active subscription.
pl_pl: Strony, które wymagają aktywnej subskrypcji.

source: Hold Ctrl (Cmd on Mac) to select multiple pages.
pl_pl: Przytrzymaj Ctrl (Cmd na Mac) aby wybrać wiele stron.

source: Prefer account creation via Easytools Automation (recommended)
pl_pl: Preferuj tworzenie kont przez Automatyzację Easytools (rekomendowane)

source: If checked, plugin will wait specified time for account creation by Easytools. If account is not created, webhook will create it automatically.
pl_pl: Jeśli zaznaczone, wtyczka będzie czekać określony czas na utworzenie konta przez Easytools. Jeśli konto nie zostanie utworzone, webhook utworzy je automatycznie.

source: Time (in seconds) to wait for account creation by Easytools Automation.
pl_pl: Czas (w sekundach) oczekiwania na utworzenie konta przez Automatyzację Easytools.

source: Role assigned to new users created by webhook.
pl_pl: Rola przypisana nowym użytkownikom tworzonym przez webhook.

source: Send welcome email with login credentials
pl_pl: Wyślij email powitalny z danymi do logowania

source: Send notifications about new/expired subscriptions
pl_pl: Wysyłaj powiadomienia o nowych/wygasłych subskrypcjach

source: Easytools Webhook Testing
pl_pl: Test Webhooków Easytools

source: Webhook Endpoint
pl_pl: Endpoint Webhook

source: Copy
pl_pl: Kopiuj

source: Not configured
pl_pl: Nie ustawiono

source: Signing key is not configured. Set it in Settings tab.
pl_pl: Klucz podpisu nie jest ustawiony. Ustaw go w zakładce Ustawienia.

source: How to test in Postman
pl_pl: Jak testować w Postman

source: Open Postman and create a new request
pl_pl: Otwórz Postman i utwórz nowy request

source: Method: POST
pl_pl: Metoda: POST

source: Set Headers:
pl_pl: Ustaw Headers:

source: Select JSON payload from examples below
pl_pl: Wybierz payload JSON z przykładów poniżej

source: Generate HMAC signature using calculator below
pl_pl: Wygeneruj podpis HMAC używając kalkulatora poniżej

source: Send request
pl_pl: Wyślij request

source: Check response and logs in "Webhook Logs" tab
pl_pl: Sprawdź odpowiedź i logi w zakładce "Logi Webhooków"

source: HMAC SHA256 Signature Calculator
pl_pl: Kalkulator podpisu HMAC SHA256

source: Paste JSON payload to generate x-webhook-signature for Postman
pl_pl: Wklej payload JSON, aby wygenerować podpis x-webhook-signature dla Postmana

source: You must first set the Signing Key in Settings tab!
pl_pl: Musisz najpierw ustawić Klucz podpisu w zakładce Ustawienia!

source: JSON Payload:
pl_pl: Payload JSON:

source: Generate Signature
pl_pl: Generuj podpis

source: Example Payloads
pl_pl: Przykładowe Payloady

source: Click "Edit" to modify payloads before testing. Changes are temporary.
pl_pl: Kliknij "Edytuj" aby zmodyfikować payloady przed testowaniem. Zmiany są tymczasowe.

source: Edit
pl_pl: Edytuj

source: Copy JSON
pl_pl: Kopiuj JSON

source: Use in calculator
pl_pl: Użyj w kalkulatorze

source: Send test webhook
pl_pl: Wyślij testowy webhook

source: Developer Mode
pl_pl: Tryb deweloperski

source: In developer mode, webhook signature verification is DISABLED. Use only for testing!
pl_pl: W trybie deweloperskim weryfikacja podpisu webhook jest WYŁĄCZONA. Używaj tylko do testów!

source: Enable developer mode (disable signature verification)
pl_pl: Włącz tryb deweloperski (wyłącz weryfikację podpisu)

source: WARNING: Disable developer mode in production! This is dangerous.
pl_pl: UWAGA: Wyłącz tryb deweloperski na produkcji! To niebezpieczne.

source: Product Assigned
pl_pl: Przypisanie produktu

source: Webhook sent when product is assigned to user (most important event)
pl_pl: Webhook wysyłany gdy produkt zostaje przypisany do użytkownika (najważniejsze zdarzenie)

source: Subscription Created
pl_pl: Utworzenie subskrypcji

source: Webhook sent when customer purchases subscription
pl_pl: Webhook wysyłany gdy klient kupuje subskrypcję

source: Subscription Expired
pl_pl: Wygaśnięcie subskrypcji

source: Webhook sent when subscription expires
pl_pl: Webhook wysyłany gdy subskrypcja wygasa

source: Subscription Cancelled
pl_pl: Anulowanie subskrypcji

source: Webhook sent when user cancels subscription
pl_pl: Webhook wysyłany gdy użytkownik anuluje subskrypcję

source: Subscription Renewed
pl_pl: Odnowienie subskrypcji

source: Webhook sent when subscription is renewed
pl_pl: Webhook wysyłany gdy subskrypcja zostaje odnowiona

source: Subscription Paused
pl_pl: Wstrzymanie subskrypcji

source: Webhook sent when subscription is paused
pl_pl: Webhook wysyłany gdy subskrypcja zostaje wstrzymana

source: Subscription Plan Changed
pl_pl: Zmiana planu subskrypcji

source: Webhook sent when user changes subscription plan
pl_pl: Webhook wysyłany gdy użytkownik zmienia plan subskrypcji

source: One Time Purchase (Lifetime)
pl_pl: Zakup jednorazowy (Lifetime)

source: Webhook for lifetime purchase (no renewals)
pl_pl: Webhook dla zakupu lifetime (bez odnowień)

source: Copied to clipboard!
pl_pl: Skopiowano do schowka!

source: Edit mode enabled. Click "Copy JSON" or "Send" when done.
pl_pl: Tryb edycji włączony. Kliknij "Kopiuj JSON" lub "Wyślij" kiedy skończysz.

source: Payload copied to clipboard!
pl_pl: Payload skopiowany do schowka!

source: Signature copied to clipboard!
pl_pl: Podpis skopiowany do schowka!

source: Paste JSON payload!
pl_pl: Wklej payload JSON!

source: Invalid JSON format!
pl_pl: Nieprawidłowy format JSON!

source: Error generating signature
pl_pl: Błąd generowania podpisu

source: Send test webhook?
pl_pl: Wysłać testowy webhook?

source: Check result in "Webhook Logs" tab
pl_pl: Sprawdź wynik w zakładce "Logi Webhooków"

source: Error sending webhook
pl_pl: Błąd wysyłania webhooka

source: Developer mode ENABLED. Signature verification disabled!
pl_pl: Tryb deweloperski WŁĄCZONY. Weryfikacja podpisu wyłączona!

source: Developer mode DISABLED. Signature verification enabled.
pl_pl: Tryb deweloperski WYŁĄCZONY. Weryfikacja podpisu włączona.

source: Insufficient permissions
pl_pl: Brak uprawnień

source: Signing key is not configured
pl_pl: Klucz podpisu nie jest ustawiony

source: Payload is empty
pl_pl: Payload jest pusty

source: Invalid JSON format
pl_pl: Nieprawidłowy format JSON

source: Signature generated successfully
pl_pl: Podpis wygenerowany pomyślnie

source: Webhook sent successfully!
pl_pl: Webhook wysłany pomyślnie!

source: HTTP Error %d
pl_pl: Błąd HTTP %d

source: Login Required
pl_pl: Wymagane logowanie

source: Log In
pl_pl: Zaloguj się

source: Subscription Required
pl_pl: Wymagana subskrypcja

source: Get Access
pl_pl: Wykup dostęp

source: Payment URL not configured. Please contact the administrator.
pl_pl: URL płatności nie jest skonfigurowany. Skontaktuj się z administratorem.

source: Configuration Error
pl_pl: Błąd konfiguracji

source: Hello, %s!
pl_pl: Witaj, %s!

source: [Error: Payment URL not configured]
pl_pl: [Błąd: URL płatności nie jest skonfigurowany]

source: Log in to see your subscription status.
pl_pl: Zaloguj się, aby zobaczyć status subskrypcji.

source: Log in to view this content.
pl_pl: Zaloguj się, aby zobaczyć tę treść.

source: This content is available only to users with an active subscription.
pl_pl: Ta treść jest dostępna tylko dla użytkowników z aktywną subskrypcją.

source: Your Subscription Status
pl_pl: Status Twojej subskrypcji

source: Active
pl_pl: Aktywna

source: Inactive
pl_pl: Nieaktywna

source: Type:
pl_pl: Typ:

source: Renewal Date:
pl_pl: Data odnowienia:

source: Lifetime access - no renewals
pl_pl: Dostęp dożywotni - bez odnowień

source: Subscription
pl_pl: Subskrypcja

source: Easytools Subscriptions
pl_pl: Subskrypcje Easytools

source: User has access
pl_pl: Użytkownik ma dostęp

source: Subscription Type
pl_pl: Typ subskrypcji

source: Start Date
pl_pl: Data rozpoczęcia

source: Renewal Date
pl_pl: Data odnowienia

source: One-time Payment
pl_pl: Jednorazowa płatność

source: Filter by subscription
pl_pl: Filtruj po subskrypcji

source: All subscriptions
pl_pl: Wszystkie subskrypcje

source: Date
pl_pl: Data

source: Event Type
pl_pl: Typ zdarzenia

source: Customer Email
pl_pl: Email klienta

source: User ID
pl_pl: ID użytkownika

source: Actions
pl_pl: Akcje

source: No webhook logs found.
pl_pl: Brak logów webhooków.

source: Details
pl_pl: Szczegóły

source: Webhook Details
pl_pl: Szczegóły webhooka

source: Close
pl_pl: Zamknij

source: Request Body (received webhook)
pl_pl: Request Body (otrzymany webhook)

source: Response Body (plugin response)
pl_pl: Response Body (odpowiedź wtyczki)

source: Users with Subscription
pl_pl: Użytkownicy z subskrypcją

source: User
pl_pl: Użytkownik

source: No active subscriptions.
pl_pl: Brak aktywnych subskrypcji.

source: 📊 Easytools Subscriptions
pl_pl: 📊 Subskrypcje Easytools

source: Active Subscriptions
pl_pl: Aktywne subskrypcje

source: View All
pl_pl: Zobacz wszystkie

source: Quick Stats
pl_pl: Szybkie statystyki

source: Recent Webhooks
pl_pl: Ostatnie webhooki

source: No recent webhooks
pl_pl: Brak ostatnich webhooków
